LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <Arduino.h>
#include <WiFi.h>
#include <ArduinoJson.h>
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "driver/ledc.h"
#include "esp_ota_ops.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "sdkconfig.h"
#include "camera_index.h"

#if defined(SMALLCAR_FW_PRODUCT)
#define SMALLCAR_IS_PRODUCT 1
#define SMALLCAR_IS_GEEK 0
#include "camera_index_product.h"
#else
#define SMALLCAR_IS_PRODUCT 0
#define SMALLCAR_IS_GEEK 1
#endif

extern int g_battery_mv;
extern int g_battery_percent;
extern uint32_t g_battery_ts_ms;
extern bool load_sta_config_from_nvs(char *out_ssid, size_t out_ssid_size, char *out_psk, size_t out_psk_size);
extern bool save_sta_config_to_nvs(const char *in_ssid, const char *in_psk);

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define LED_LEDC_GPIO             4   // ESP32-CAM flash LED 一般接 GPIO4
#define LED_LEDC_CHANNEL          LEDC_CHANNEL_1
#define LED_LEDC_TIMER            LEDC_TIMER_1
#define LED_LEDC_MODE             LEDC_HIGH_SPEED_MODE
#define CONFIG_LED_MAX_INTENSITY  255

int led_duty = 0;
bool isStreaming = false;

#endif

// OTA 状态跟踪：用于在 /status 中向前端暴露最近一次 OTA 结果，方便诊断
// ota_last_result: 0=未执行，1=成功，-1=失败
static int s_ota_last_result = 0;
// ota_last_error: esp_err_t 数值（失败时），0 表示无错误 / 成功
static int s_ota_last_error = 0;
// ota_last_size: 最近一次接收到并写入的固件总字节数
static int s_ota_last_size = 0;
// ota_last_ts: 最近一次 OTA 结束（成功或失败）时的时间戳（毫秒）
static int64_t s_ota_last_ts = 0;

#define OTA_NVS_NAMESPACE "ota_diag"
#define OTA_NVS_KEY_RESULT "result"
#define OTA_NVS_KEY_ERROR  "error"
#define OTA_NVS_KEY_SIZE   "size"
#define OTA_NVS_KEY_TS     "ts"
#define OTA_NVS_KEY_PREERASE "preerase"

#define SNAPSHOT_ROUTER_DEFAULT_HOST "192.168.31.1"
#define SNAPSHOT_ROUTER_DEFAULT_PORT 8099
#define SNAPSHOT_ROUTER_DEFAULT_PATH "/upload_snapshot"

static void ota_diag_load_from_nvs(void) {
  nvs_handle_t h;
  esp_err_t err = nvs_open(OTA_NVS_NAMESPACE, NVS_READONLY, &h);
  if (err != ESP_OK) {
    return;
  }

  int32_t v32;
  int64_t v64;

  if (nvs_get_i32(h, OTA_NVS_KEY_RESULT, &v32) == ESP_OK) {
    s_ota_last_result = v32;
  }
  if (nvs_get_i32(h, OTA_NVS_KEY_ERROR, &v32) == ESP_OK) {
    s_ota_last_error = v32;
  }
  if (nvs_get_i32(h, OTA_NVS_KEY_SIZE, &v32) == ESP_OK) {
    s_ota_last_size = v32;
  }
  if (nvs_get_i64(h, OTA_NVS_KEY_TS, &v64) == ESP_OK) {
    s_ota_last_ts = v64;
  }

  nvs_close(h);
}

static void ota_diag_save_to_nvs(int result, int error, int size) {
  s_ota_last_result = result;
  s_ota_last_error = error;
  s_ota_last_size = size;
  s_ota_last_ts = esp_timer_get_time() / 1000;

  nvs_handle_t h;
  esp_err_t err = nvs_open(OTA_NVS_NAMESPACE, NVS_READWRITE, &h);
  if (err != ESP_OK) {
    log_e("OTA: nvs_open failed: %d", err);
    return;
  }

  nvs_set_i32(h, OTA_NVS_KEY_RESULT, s_ota_last_result);
  nvs_set_i32(h, OTA_NVS_KEY_ERROR, s_ota_last_error);
  nvs_set_i32(h, OTA_NVS_KEY_SIZE, s_ota_last_size);
  nvs_set_i64(h, OTA_NVS_KEY_TS, s_ota_last_ts);

  err = nvs_commit(h);
  if (err != ESP_OK) {
    log_e("OTA: nvs_commit failed: %d", err);
  }

  nvs_close(h);
}

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if CONFIG_LED_ILLUMINATOR_ENABLED
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledc_set_duty(LED_LEDC_MODE, LED_LEDC_CHANNEL, duty);
  ledc_update_duty(LED_LEDC_MODE, LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

