LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

static int hex_value(char c) {
  if (c >= '0' && c <= '9') return c - '0';
  if (c >= 'a' && c <= 'f') return 10 + (c - 'a');
  if (c >= 'A' && c <= 'F') return 10 + (c - 'A');
  return -1;
}

static void url_decode_inplace(char *s) {
  char *src = s;
  char *dst = s;
  while (*src) {
    if (*src == '%' && src[1] && src[2]) {
      int hi = hex_value(src[1]);
      int lo = hex_value(src[2]);
      if (hi >= 0 && lo >= 0) {
        *dst++ = (char)((hi << 4) | lo);
        src += 3;
        continue;
      }
    }
    if (*src == '+') {
      *dst++ = ' ';
      src++;
    } else {
      *dst++ = *src++;
    }
  }
  *dst = '\0';
}

#if SMALLCAR_IS_GEEK
static esp_err_t snapshot_to_router_handler(httpd_req_t *req) {
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    log_e("snapshot_to_router: camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  char router_host[64];
  snprintf(router_host, sizeof(router_host), "%s", SNAPSHOT_ROUTER_DEFAULT_HOST);
  int router_port = SNAPSHOT_ROUTER_DEFAULT_PORT;
  char router_path[128];
  snprintf(router_path, sizeof(router_path), "%s", SNAPSHOT_ROUTER_DEFAULT_PATH);

  size_t qlen = httpd_req_get_url_query_len(req);
  if (qlen > 0) {
    char *query = (char *)malloc(qlen + 1);
    if (query) {
      if (httpd_req_get_url_query_str(req, query, qlen + 1) == ESP_OK) {
        char value[96];
        if (httpd_query_key_value(query, "host", value, sizeof(value)) == ESP_OK) {
          snprintf(router_host, sizeof(router_host), "%s", value);
        }
        if (httpd_query_key_value(query, "port", value, sizeof(value)) == ESP_OK) {
          int p = atoi(value);
          if (p > 0 && p < 65536) {
            router_port = p;
          }
        }
        if (httpd_query_key_value(query, "path", value, sizeof(value)) == ESP_OK) {
          if (value[0] != '\0') {
            snprintf(router_path, sizeof(router_path), "%s", value);
          }
        }
      }
      free(query);
    }
  }

  url_decode_inplace(router_path);

  WiFiClient client;
  if (!client.connect(router_host, router_port)) {
    log_e("snapshot_to_router: connect to %s:%d failed", router_host, router_port);
    esp_camera_fb_return(fb);
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  client.printf("POST %s HTTP/1.1\r\n", router_path);
  client.printf("Host: %s:%d\r\n", router_host, router_port);
  client.print("Content-Type: image/jpeg\r\n");
  client.printf("Content-Length: %u\r\n", (unsigned int)fb->len);
  client.print("Connection: close\r\n");
  client.print("\r\n");

  size_t written = 0;
  const uint8_t *buf = fb->buf;
  size_t len = fb->len;
  while (written < len) {
    size_t w = client.write(buf + written, len - written);
    if (w == 0) {
      break;
    }
    written += w;
  }

  esp_camera_fb_return(fb);

  if (written != len) {
    log_e("snapshot_to_router: short write %u/%u", (unsigned int)written, (unsigned int)len);
    client.stop();
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  bool router_http_ok = false;
  bool got_status_line = false;
  String status_line;
  uint32_t start = millis();
  while (client.connected() && (millis() - start) < 2000) {
    while (client.available()) {
      char c = (char)client.read();
      if (!got_status_line) {
        if (c == '\r') {
          continue;
        }
        if (c == '\n') {
          got_status_line = true;
          if (status_line.startsWith("HTTP/1.1 200") || status_line.startsWith("HTTP/1.0 200")) {
            router_http_ok = true;
          }
          // 之后的内容直接丢弃
          continue;
        }
        if (status_line.length() < 80) {
          status_line += c;
        }
      }
    }
    delay(10);
  }
  client.stop();

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_type(req, "application/json");
  char resp[160];
  bool overall_ok = router_http_ok;
  int n = snprintf(
    resp,
    sizeof(resp),
    "{\"ok\":%s,\"host\":\"%s\",\"port\":%d,\"path\":\"%s\",\"bytes\":%u}",
    overall_ok ? "true" : "false",
    router_host,
    router_port,
    router_path,
    (unsigned int)written
  );
  if (n < 0 || n >= (int)sizeof(resp)) {
    httpd_resp_send(req, "{\"ok\":true}", strlen("{\"ok\":true}"));
  } else {
    httpd_resp_send(req, resp, n);
  }
  return ESP_OK;
}
#else
static esp_err_t snapshot_to_router_handler(httpd_req_t *req) {
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_type(req, "application/json");
  const char *resp = "{\"ok\":false,\"error\":\"disabled_in_product_fw\"}";
  return httpd_resp_send(req, resp, strlen(resp));
}
#endif

static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame) {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

#if CONFIG_LED_ILLUMINATOR_ENABLED
  isStreaming = true;
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      log_e("Send frame failed");
      break;
    }
    int64_t fr_end = esp_timer_get_time();

    int64_t frame_time = fr_end - last_frame;
    frame_time /= 1000;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
    // 只每 30 帧打印一次，减少串口开销
    static int log_counter = 0;
    if (++log_counter >= 30) {
      log_counter = 0;
      log_i(
        "MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)", (uint32_t)(_jpg_buf_len), (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time, avg_frame_time,
        1000.0 / avg_frame_time
      );
    }
#endif
    last_frame = fr_end;
    
    // === CRITICAL: 让出 CPU 给 WiFi/TCP 栈和看门狗 ===
    vTaskDelay(1);  // 1 tick，避免任务饥饿
  }

#if CONFIG_LED_ILLUMINATOR_ENABLED
  isStreaming = false;
  enable_led(false);
#endif

  return res;
}

