LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
static esp_err_t parse_get(httpd_req_t *req, char **obuf) {
  char *buf = NULL;
  size_t buf_len = 0;

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      *obuf = buf;
      return ESP_OK;
    }
    free(buf);
  }
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

static esp_err_t cmd_handler(httpd_req_t *req) {
  char *buf = NULL;
  char variable[32];
  char value[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK || httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  // 画质预设：在解析数值之前单独处理，支持字符串取值
  if (!strcmp(variable, "preset")) {
    sensor_t *s = esp_camera_sensor_get();
    if (!s) {
      return httpd_resp_send_500(req);
    }

    int pres_res = 0;
    if (!strcmp(value, "low")) {
      log_i("Apply preset: low");
      if (s->pixformat == PIXFORMAT_JPEG) {
        pres_res |= s->set_framesize(s, FRAMESIZE_QVGA);
      }
      pres_res |= s->set_quality(s, 20);   // 较小分辨率 + 较高压缩，追求流畅
      pres_res |= s->set_brightness(s, 0);
      pres_res |= s->set_contrast(s, 0);
      pres_res |= s->set_saturation(s, 0);
    } else if (!strcmp(value, "normal")) {
      log_i("Apply preset: normal");
      if (s->pixformat == PIXFORMAT_JPEG) {
        pres_res |= s->set_framesize(s, FRAMESIZE_VGA);
      }
      pres_res |= s->set_quality(s, 12);   // 画质/延迟折中
      pres_res |= s->set_brightness(s, 0);
      pres_res |= s->set_contrast(s, 0);
      pres_res |= s->set_saturation(s, 0);
    } else if (!strcmp(value, "high")) {
      log_i("Apply preset: high");
      if (s->pixformat == PIXFORMAT_JPEG) {
        pres_res |= s->set_framesize(s, FRAMESIZE_SVGA);
      }
      pres_res |= s->set_quality(s, 10);   // 更高画质，带来一定带宽/负载增加
      pres_res |= s->set_brightness(s, 0);
      pres_res |= s->set_contrast(s, 0);
      pres_res |= s->set_saturation(s, 0);
    } else {
      log_i("Unknown preset: %s", value);
      pres_res = -1;
    }

    if (pres_res < 0) {
      return httpd_resp_send_500(req);
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
  }

  int val = atoi(value);
  log_i("%s = %d", variable, val);
  sensor_t *s = esp_camera_sensor_get();
  int res = 0;

  if (!strcmp(variable, "framesize")) {
    if (s->pixformat == PIXFORMAT_JPEG) {
      res = s->set_framesize(s, (framesize_t)val);
    }
  } else if (!strcmp(variable, "quality")) {
    res = s->set_quality(s, val);
  } else if (!strcmp(variable, "contrast")) {
    res = s->set_contrast(s, val);
  } else if (!strcmp(variable, "brightness")) {
    res = s->set_brightness(s, val);
  } else if (!strcmp(variable, "saturation")) {
    res = s->set_saturation(s, val);
  } else if (!strcmp(variable, "gainceiling")) {
    res = s->set_gainceiling(s, (gainceiling_t)val);
  } else if (!strcmp(variable, "colorbar")) {
    res = s->set_colorbar(s, val);
  } else if (!strcmp(variable, "awb")) {
    res = s->set_whitebal(s, val);
  } else if (!strcmp(variable, "agc")) {
    res = s->set_gain_ctrl(s, val);
  } else if (!strcmp(variable, "aec")) {
    res = s->set_exposure_ctrl(s, val);
  } else if (!strcmp(variable, "hmirror")) {
    res = s->set_hmirror(s, val);
  } else if (!strcmp(variable, "vflip")) {
    res = s->set_vflip(s, val);
  } else if (!strcmp(variable, "awb_gain")) {
    res = s->set_awb_gain(s, val);
  } else if (!strcmp(variable, "agc_gain")) {
    res = s->set_agc_gain(s, val);
  } else if (!strcmp(variable, "aec_value")) {
    res = s->set_aec_value(s, val);
  } else if (!strcmp(variable, "aec2")) {
    res = s->set_aec2(s, val);
  } else if (!strcmp(variable, "dcw")) {
    res = s->set_dcw(s, val);
  } else if (!strcmp(variable, "bpc")) {
    res = s->set_bpc(s, val);
  } else if (!strcmp(variable, "wpc")) {
    res = s->set_wpc(s, val);
  } else if (!strcmp(variable, "raw_gma")) {
    res = s->set_raw_gma(s, val);
  } else if (!strcmp(variable, "lenc")) {
    res = s->set_lenc(s, val);
  } else if (!strcmp(variable, "special_effect")) {
    res = s->set_special_effect(s, val);
  } else if (!strcmp(variable, "wb_mode")) {
    res = s->set_wb_mode(s, val);
  } else if (!strcmp(variable, "ae_level")) {
    res = s->set_ae_level(s, val);
  }
#if CONFIG_LED_ILLUMINATOR_ENABLED
  else if (!strcmp(variable, "led_intensity")) {
    led_duty = val;
    if (led_duty > 0) {
      enable_led(true);
    } else {
      enable_led(false);
    }
  }
#endif
  else {
    log_i("Unknown command: %s", variable);
    res = -1;
  }

  if (res < 0) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static int print_reg(char *p, sensor_t *s, uint16_t reg, uint32_t mask) {
  return sprintf(p, "\"0x%x\":%u,", reg, s->get_reg(s, reg, mask));
}

// 固件构建信息，用于前端确认 OTA 升级是否生效
#ifndef FW_VERSION
#define FW_VERSION "DEV10"
#endif
#define FW_BUILD_STR __DATE__ " " __TIME__

static esp_err_t status_handler(httpd_req_t *req) {
  // 原始示例里是 1024 字节，但我们额外增加了多组寄存器和 OTA 诊断字段，
  // 1KB 容易不够用，导致缓冲区溢出、破坏 led_duty / s_ota_last_* 等全局变量。
  // 这里把缓冲区加大到 4KB，简单可靠地避免溢出问题。
  static char json_response[4096];

  sensor_t *s = esp_camera_sensor_get();
  char *p = json_response;
  *p++ = '{';

  if (s->id.PID == OV5640_PID || s->id.PID == OV3660_PID) {
    for (int reg = 0x3400; reg < 0x3406; reg += 2) {
      p += print_reg(p, s, reg, 0xFFF);  //12 bit
    }
    p += print_reg(p, s, 0x3406, 0xFF);

    p += print_reg(p, s, 0x3500, 0xFFFF0);  //16 bit
    p += print_reg(p, s, 0x3503, 0xFF);
    p += print_reg(p, s, 0x350a, 0x3FF);   //10 bit
    p += print_reg(p, s, 0x350c, 0xFFFF);  //16 bit

    for (int reg = 0x5480; reg <= 0x5490; reg++) {
      p += print_reg(p, s, reg, 0xFF);
    }

    for (int reg = 0x5380; reg <= 0x538b; reg++) {
      p += print_reg(p, s, reg, 0xFF);
    }

