LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
    for (int reg = 0x5580; reg < 0x558a; reg++) {
      p += print_reg(p, s, reg, 0xFF);
    }
    p += print_reg(p, s, 0x558a, 0x1FF);  //9 bit
  } else if (s->id.PID == OV2640_PID) {
    p += print_reg(p, s, 0xd3, 0xFF);
    p += print_reg(p, s, 0x111, 0xFF);
    p += print_reg(p, s, 0x132, 0xFF);
  }

  p += sprintf(p, "\"xclk\":%u,", s->xclk_freq_hz / 1000000);
  p += sprintf(p, "\"pixformat\":%u,", s->pixformat);
  p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
  p += sprintf(p, "\"quality\":%u,", s->status.quality);
  p += sprintf(p, "\"brightness\":%d,", s->status.brightness);
  p += sprintf(p, "\"contrast\":%d,", s->status.contrast);
  p += sprintf(p, "\"saturation\":%d,", s->status.saturation);
  p += sprintf(p, "\"sharpness\":%d,", s->status.sharpness);
  p += sprintf(p, "\"special_effect\":%u,", s->status.special_effect);
  p += sprintf(p, "\"wb_mode\":%u,", s->status.wb_mode);
  p += sprintf(p, "\"awb\":%u,", s->status.awb);
  p += sprintf(p, "\"awb_gain\":%u,", s->status.awb_gain);
  p += sprintf(p, "\"aec\":%u,", s->status.aec);
  p += sprintf(p, "\"aec2\":%u,", s->status.aec2);
  p += sprintf(p, "\"ae_level\":%d,", s->status.ae_level);
  p += sprintf(p, "\"aec_value\":%u,", s->status.aec_value);
  p += sprintf(p, "\"agc\":%u,", s->status.agc);
  p += sprintf(p, "\"agc_gain\":%u,", s->status.agc_gain);
  p += sprintf(p, "\"gainceiling\":%u,", s->status.gainceiling);
  p += sprintf(p, "\"bpc\":%u,", s->status.bpc);
  p += sprintf(p, "\"wpc\":%u,", s->status.wpc);
  p += sprintf(p, "\"raw_gma\":%u,", s->status.raw_gma);
  p += sprintf(p, "\"lenc\":%u,", s->status.lenc);
  p += sprintf(p, "\"hmirror\":%u,", s->status.hmirror);
  p += sprintf(p, "\"vflip\":%u,", s->status.vflip);
  p += sprintf(p, "\"dcw\":%u,", s->status.dcw);
  p += sprintf(p, "\"colorbar\":%u", s->status.colorbar);
#if CONFIG_LED_ILLUMINATOR_ENABLED
  p += sprintf(p, ",\"led_intensity\":%u", led_duty);
#else
  p += sprintf(p, ",\"led_intensity\":%d", -1);
#endif
  p += sprintf(p, ",\"fw_version\":\"%s\"", FW_VERSION);
  // 在状态 JSON 中附带固件构建时间，便于前端确认 OTA 升级后的版本
  p += sprintf(p, ",\"fw_build\":\"%s\"", FW_BUILD_STR);
  
  // OTA 分区信息：诊断分区表配置问题
  const esp_partition_t *running = esp_ota_get_running_partition();
  if (running) {
    p += sprintf(p, ",\"ota_running_label\":\"%s\"", running->label);
    p += sprintf(p, ",\"ota_running_addr\":%lu", (unsigned long)running->address);
    p += sprintf(p, ",\"ota_running_size\":%lu", (unsigned long)running->size);
  } else {
    p += sprintf(p, ",\"ota_running_label\":\"unknown\"");
    p += sprintf(p, ",\"ota_running_addr\":0");
    p += sprintf(p, ",\"ota_running_size\":0");
  }
  
  const esp_partition_t *next_update = esp_ota_get_next_update_partition(NULL);
  if (next_update) {
    p += sprintf(p, ",\"ota_next_label\":\"%s\"", next_update->label);
    p += sprintf(p, ",\"ota_next_addr\":%lu", (unsigned long)next_update->address);
    p += sprintf(p, ",\"ota_next_size\":%lu", (unsigned long)next_update->size);
  } else {
    p += sprintf(p, ",\"ota_next_label\":\"none\"");
    p += sprintf(p, ",\"ota_next_addr\":0");
    p += sprintf(p, ",\"ota_next_size\":0");
  }
  
  // OTA 诊断字段：方便前端在没有串口日志的情况下查看最近一次 OTA 结果
  p += sprintf(p, ",\"ota_last_result\":%d", s_ota_last_result);
  p += sprintf(p, ",\"ota_last_error\":%d", s_ota_last_error);
  p += sprintf(p, ",\"ota_last_size\":%d", s_ota_last_size);
  p += sprintf(p, ",\"ota_last_ts\":%lld", (long long)s_ota_last_ts);
  *p++ = '}';
  *p++ = 0;
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}

#if SMALLCAR_IS_PRODUCT
static String s_wifi_scan_cached;

static void wifi_scan_cache_init() {
  DynamicJsonDocument doc(2048);
  JsonArray arr = doc.createNestedArray("networks");

  int16_t n = WiFi.scanNetworks();
  if (n > 0) {
    for (int16_t i = 0; i < n; i++) {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0) {
        continue;
      }
      JsonObject obj = arr.createNestedObject();
      obj["ssid"] = ssid;
      obj["rssi"] = WiFi.RSSI(i);
      obj["sec"] = (int)WiFi.encryptionType(i);
    }
  }
  WiFi.scanDelete();

  String out;
  serializeJson(doc, out);
  s_wifi_scan_cached = out;
}

static esp_err_t wifi_state_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  String apSsid = WiFi.softAPSSID();
  IPAddress apIp = WiFi.softAPIP();
  String apIpStr = apIp.toString();

  bool staConnected = WiFi.status() == WL_CONNECTED;

  char savedSsid[33];
  char savedPsk[65];
  savedSsid[0] = '\0';
  savedPsk[0] = '\0';
  bool staConfigured = load_sta_config_from_nvs(savedSsid, sizeof(savedSsid), savedPsk, sizeof(savedPsk));

  char staSsid[33];
  staSsid[0] = '\0';
  if (staConfigured && savedSsid[0] != '\0') {
    strncpy(staSsid, savedSsid, sizeof(staSsid) - 1U);
    staSsid[sizeof(staSsid) - 1U] = '\0';
  } else {
    String cur = WiFi.SSID();
    size_t len = cur.length();
    if (len >= sizeof(staSsid)) {
      len = sizeof(staSsid) - 1U;
    }
    memcpy(staSsid, cur.c_str(), len);
    staSsid[len] = '\0';
  }

  IPAddress staIp = WiFi.localIP();
  String staIpStr = staConnected ? staIp.toString() : String("");

  StaticJsonDocument<384> doc;
  doc["ok"] = true;
  doc["ap_ssid"] = apSsid;
  doc["ap_ip"] = apIpStr;
  doc["sta_configured"] = staConfigured;
  doc["sta_connected"] = staConnected;
  doc["sta_ssid"] = staSsid;
  doc["sta_ip"] = staIpStr;

  String out;
  serializeJson(doc, out);
  return httpd_resp_send(req, out.c_str(), out.length());
}

static esp_err_t wifi_scan_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  if (s_wifi_scan_cached.length() == 0) {
    DynamicJsonDocument doc(256);
    JsonArray arr = doc.createNestedArray("networks");
    String out;
    serializeJson(doc, out);
    return httpd_resp_send(req, out.c_str(), out.length());
  }

