LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
  return httpd_resp_send(req, s_wifi_scan_cached.c_str(), s_wifi_scan_cached.length());
}

static esp_err_t wifi_config_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  int total = req->content_len;
  if (total <= 0 || total > 512) {
    const char *resp = "{\"ok\":false,\"error\":\"invalid_length\"}";
    return httpd_resp_send(req, resp, strlen(resp));
  }

  char buf[512];
  int received = 0;
  while (received < total && received < (int)(sizeof(buf) - 1U)) {
    int r = httpd_req_recv(req, buf + received, total - received);
    if (r <= 0) {
      const char *resp = "{\"ok\":false,\"error\":\"recv_failed\"}";
      return httpd_resp_send(req, resp, strlen(resp));
    }
    received += r;
  }
  buf[received] = '\0';

  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, buf);
  if (err) {
    const char *resp = "{\"ok\":false,\"error\":\"json_parse\"}";
    return httpd_resp_send(req, resp, strlen(resp));
  }

  const char *cfg_ssid = doc["ssid"];
  const char *cfg_password = doc["password"];
  if (!cfg_ssid || cfg_ssid[0] == '\0') {
    const char *resp = "{\"ok\":false,\"error\":\"empty_ssid\"}";
    return httpd_resp_send(req, resp, strlen(resp));
  }

  if (!save_sta_config_to_nvs(cfg_ssid, cfg_password)) {
    const char *resp = "{\"ok\":false,\"error\":\"save_failed\"}";
    return httpd_resp_send(req, resp, strlen(resp));
  }

  WiFi.begin(cfg_ssid, cfg_password);

  StaticJsonDocument<128> respDoc;
  respDoc["ok"] = true;
  respDoc["sta_ssid"] = cfg_ssid;

  String out;
  serializeJson(respDoc, out);
  return httpd_resp_send(req, out.c_str(), out.length());
}
#endif

static esp_err_t battery_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  int mv = g_battery_mv;
  int percent = g_battery_percent;

  uint32_t now_ms = (uint32_t)millis();
  uint32_t age_ms = 0;
  if (g_battery_ts_ms != 0) {
    age_ms = now_ms - g_battery_ts_ms;
  }

  bool ok = (mv >= 0) && (percent >= 0) && (age_ms <= 15000U);

  char buf[128];
  int n = snprintf(
      buf,
      sizeof(buf),
      "{\"ok\":%s,\"mv\":%d,\"percent\":%d,\"age_ms\":%lu}",
      ok ? "true" : "false",
      mv,
      percent,
      (unsigned long)age_ms);
  if (n < 0) {
    const char *fallback = "{\"ok\":false}";
    return httpd_resp_send(req, fallback, strlen(fallback));
  }
  if ((size_t)n >= sizeof(buf)) {
    n = (int)(sizeof(buf) - 1U);
    buf[n] = '\0';
  }

  return httpd_resp_send(req, buf, n);
}

static esp_err_t xclk_handler(httpd_req_t *req) {
  char *buf = NULL;
  char _xclk[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "xclk", _xclk, sizeof(_xclk)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int xclk = atoi(_xclk);
  log_i("Set XCLK: %d MHz", xclk);

  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_xclk(s, LEDC_TIMER_0, xclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t reg_handler(httpd_req_t *req) {
  char *buf = NULL;
  char _reg[32];
  char _mask[32];
  char _val[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "reg", _reg, sizeof(_reg)) != ESP_OK || httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK
      || httpd_query_key_value(buf, "val", _val, sizeof(_val)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int reg = atoi(_reg);
  int mask = atoi(_mask);
  int val = atoi(_val);
  log_i("Set Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x", reg, mask, val);

  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_reg(s, reg, mask, val);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t greg_handler(httpd_req_t *req) {
  char *buf = NULL;
  char _reg[32];
  char _mask[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "reg", _reg, sizeof(_reg)) != ESP_OK || httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int reg = atoi(_reg);
  int mask = atoi(_mask);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->get_reg(s, reg, mask);
  if (res < 0) {
    return httpd_resp_send_500(req);
  }
  log_i("Get Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x", reg, mask, res);

  char buffer[20];
  const char *val = itoa(res, buffer, 10);
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, val, strlen(val));
}

static int parse_get_var(char *buf, const char *key, int def) {
  char _int[16];
  if (httpd_query_key_value(buf, key, _int, sizeof(_int)) != ESP_OK) {
    return def;
  }
  return atoi(_int);
}

static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

#if SMALLCAR_IS_PRODUCT
static esp_err_t send_gz_asset(httpd_req_t *req, const char *content_type, const unsigned char *data, size_t len) {
  httpd_resp_set_type(req, content_type);
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, (const char *)data, len);
}

static esp_err_t product_index_handler(httpd_req_t *req) {
  return send_gz_asset(req, "text/html", product_index_html_gz, product_index_html_gz_len);
}

static esp_err_t product_setup_handler(httpd_req_t *req) {
  return send_gz_asset(req, "text/html", product_setup_html_gz, product_setup_html_gz_len);
}

