LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
static esp_err_t product_style_handler(httpd_req_t *req) {
  return send_gz_asset(req, "text/css", product_style_css_gz, product_style_css_gz_len);
}

static esp_err_t product_main_js_handler(httpd_req_t *req) {
  return send_gz_asset(req, "application/javascript", product_main_js_gz, product_main_js_gz_len);
}

static esp_err_t product_setup_js_handler(httpd_req_t *req) {
  return send_gz_asset(req, "application/javascript", product_setup_js_gz, product_setup_js_gz_len);
}

static esp_err_t product_config_js_handler(httpd_req_t *req) {
  return send_gz_asset(req, "application/javascript", product_config_js_gz, product_config_js_gz_len);
}

static esp_err_t product_favicon_svg_handler(httpd_req_t *req) {
  return send_gz_asset(req, "image/svg+xml", product_favicon_svg_gz, product_favicon_svg_gz_len);
}

static esp_err_t product_placeholder_video_svg_handler(httpd_req_t *req) {
  return send_gz_asset(req, "image/svg+xml", product_placeholder_video_svg_gz, product_placeholder_video_svg_gz_len);
}

static esp_err_t product_version_txt_handler(httpd_req_t *req) {
  return send_gz_asset(req, "text/plain", product_version_txt_gz, product_version_txt_gz_len);
}
#endif

static esp_err_t index_handler(httpd_req_t *req) {
#if SMALLCAR_IS_PRODUCT
  return product_index_handler(req);
#else
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
#endif
}

void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 40;
  // 增加接收超时时间，防止 OTA 大文件传输时超时（默认 10 秒太短）
  // 1 分钟足够大文件传输
  config.recv_wait_timeout = 60;  // 60 秒
  config.send_wait_timeout = 60;  // 60 秒

  // 从 NVS 恢复上一次 OTA 结果，这样即使设备在 OTA 后重启，/status 也能看到最新一次 OTA 的诊断信息
  ota_diag_load_from_nvs();

#if SMALLCAR_IS_PRODUCT
  // 产品固件：在启动 HTTP 服务器前执行一次 Wi‑Fi 扫描并缓存结果，避免在 /wifi_scan 请求期间长时间阻塞导致 AP 断开
  wifi_scan_cache_init();
#endif

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

#if SMALLCAR_IS_PRODUCT
  httpd_uri_t wifi_state_uri = {
    .uri = "/wifi_state",
    .method = HTTP_GET,
    .handler = wifi_state_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t wifi_scan_uri = {
    .uri = "/wifi_scan",
    .method = HTTP_GET,
    .handler = wifi_scan_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t wifi_config_uri = {
    .uri = "/wifi_config",
    .method = HTTP_POST,
    .handler = wifi_config_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_setup_uri = {
    .uri = "/setup.html",
    .method = HTTP_GET,
    .handler = product_setup_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_style_uri = {
    .uri = "/style.css",
    .method = HTTP_GET,
    .handler = product_style_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_main_js_uri = {
    .uri = "/main.js",
    .method = HTTP_GET,
    .handler = product_main_js_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_setup_js_uri = {
    .uri = "/setup.js",
    .method = HTTP_GET,
    .handler = product_setup_js_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_config_js_uri = {
    .uri = "/config.js",
    .method = HTTP_GET,
    .handler = product_config_js_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_favicon_svg_uri = {
    .uri = "/favicon.svg",
    .method = HTTP_GET,
    .handler = product_favicon_svg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t product_placeholder_video_svg_uri = {
    .uri = "/placeholder-video.svg",
    .method = HTTP_GET,
    .handler = product_placeholder_video_svg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };
#endif

  httpd_uri_t snapshot_to_router_uri = {
    .uri = "/snapshot_to_router",
    .method = HTTP_POST,
    .handler = snapshot_to_router_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

